clear;clc;close all;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% （1）构建原始数据
x = 0:0.5:5;

y = [9.999991882 9.999993522 9.999995303 9.999996932 9.999998480 10.000000016 10.000001556 10.000003132 10.000004759 10.000006449 10.000008200;
    99.999742 99.999855 99.999885 99.999909 99.999932 99.999954 99.999976 99.999998 100.000021 100.000044 100.000068;
    156.240510 156.242944 156.244848 156.246482 156.247909 156.249294 156.250610 156.251893 156.253103 156.254301 156.255448; 
    312.484912 312.488367 312.491130 312.493547 312.495753 312.497828 312.499834 312.501784 312.503699 312.505576 312.507404;
    499.999370 499.999499 499.999613 499.999708 499.999806 499.999902 499.999999 500.000094 500.000194 500.000297 500.000403;
    ]; 

y = y .* 1e6;

% 1行n列的元胞数组，记录每一行的名称
y_names = {'10MHz','100MHz','156.25MHz', '312.5MHz', '500MHz'};

% 获取矩阵 y 的行数 (即 n)
n = size(y, 1);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% （2）循环处理每一行数据并画图
for i = 1:n
    % 提取当前第 i 行的数据和名称
    y_current = y(i, :);
    name_current = y_names{i}; % 注意：从 cell 数组取字符串必须用大括号 {}
    
    % 多项式曲线拟合
    p = polyfit(x, y_current, 1);       
    f = polyval(p, x);                  
    Kppm = p(1)*1e6 / polyval(p, 2.5);
    
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % （3）开始画图
    
    % 创建图窗，并将 name_current 显示在图窗窗口标题栏上
    figure('Name', name_current, 'NumberTitle', 'on'); 
    
    scatter(x, y_current, 'b', 'filled'); % 原始数据 (加上 'filled' 散点更清晰)
    hold on;                            
    plot(x, f, 'Color', 'r', 'LineWidth', 1.5); % 拟合曲线加粗一点
        
    xlabel('控制电压 (V)');                 
    ylabel('输出频率 (Hz)');                 
    
    % 在图表内部的 title 也加上对应的名称，并实现换行显示灵敏度
    title(sprintf('%s 频率-控制电压曲线\n压控灵敏度 = %.2f ppm', name_current, Kppm));
    legend('原始数据', '拟合直线', 'Location', 'best'); % Location best 让图例自动避开数据线
    grid on; % 开启网格线，方便观察压控线性度
end
